---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.SteelElementsFailures
source: html/7eddd34c-a339-a887-276a-a6209f114deb.htm
---
# BuiltInFailures.SteelElementsFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.